// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19, 2, 4, 9 -> [1, 2, 5, 7, 19, 2, 4, 9 ]
// 6, 1, 33, 2, 93, 15, 424, 0-> [6, 1, 33, 2, 93, 15, 424, 0]


int num;  //создание целочисленной переменной
int num1;  //создание целочисленной переменной
int num2;  //создание целочисленной переменной
int num3;  //создание целочисленной переменной
int num4;  //создание целочисленной переменной
int num5;  //создание целочисленной переменной
int num6;  //создание целочисленной переменной
int num7;  //создание целочисленной переменной
int num8;  //создание целочисленной переменной


Console.Write("Введите число 1 ");  //вывод текста без переноса строки на экран
num = Convert.ToInt32(Console.ReadLine());  //присваиваем переменной введённое значение, которое было конвертировано в тип int
Console.Write("Введите число 2 ");  //вывод текста без переноса строки на экран
num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число 3 ");  //вывод текста без переноса строки на экран
num3 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число 4 ");  //вывод текста без переноса строки на экран
num4 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число 1 ");  //вывод текста без переноса строки на экран

num5 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число 1 ");  //вывод текста без переноса строки на экран

num6 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число 1 ");  //вывод текста без переноса строки на экран

num7 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число 1 ");  //вывод текста без переноса строки на экран

num8 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число 1 ");  //вывод текста без переноса строки на экран

num2 = Convert.ToInt32(Console.ReadLine());



// int num4;  //создание целочисленной переменной
Console.WriteLine("[" + num + "," + num1 + "," + num2 + "," + num3 + "," + num4 + "," + num5 + "," + num6 + "," + num7 + "," + num8 + "]");  //вывод на экран значения переменной с переходом на следующую строку



Console.Read();

// я не знаю как ее адекватно можно решить:(